Revit 2024 API
FabricationPart.Alias Property
 The alias of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string Alias { get; }
Visual Basic
Public ReadOnly Property Alias As String
	Get
Visual C++
public:
property String^ Alias {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace